/***
 * 2018-05-11
 * 冯晓鹏
 * 用途：手动修改数据找起来太麻烦，所以将全部数据放到一块儿便于快速修改,替换
 *  只有山东省得*没有点击的时候 。。济南 。。。青岛。。 转入转出  组织关系转接迁徙模拟图  得手动调整各个圆的大小**
 *
 * */

//**************最左边得两个********************
// 全省基层党支部开展活动情况(单位:次)  省委直属党(工)委所属党支部活动开展情况(单位:次)
var f_Zzsh,f_Swqk;
function left(){
    // 全省基层党支部开展活动情况(单位:次)
    f_Zzsh=[115534,	185638,	299711,	137305,	35600,	138447,	32919,	8597,	448865];
    // 省委直属党(工)委所属党支部活动开展情况(单位:次)
    f_Swqk= [39264, 53558, 93026, 99218, 25726, 168179, 89863,
        29955, 42892, 87179, 18404, 10979, 122564, 48983,
        10228, 74148, 28675, 11805, 4411, 14542, 5195, 205, 0];
}
left();

//*******************中间上面的***************************
//全省组织关系转接转出情况  全省组织关系转接转入情况
var f_Qszc,f_Qszr;
function content(){
    // 全省组织关系转接转出情况
    f_Qszc=[
        {
        value:3715,
        name: '转往省内其他市'
    }, {
        value: 1801,
        name: '转往省委直属其他党组织'
    }, {
        value: 7866,
        name: '转往市内其他县（市、区）'
    }, {
        value: 8760,
        name: '转往市委直属其他党组织'
    }
        , {
            value: 35165,
            name: '转往县（市、区）内其他乡镇（街道）'
        }
        , {
            value: 4039,
            name: '转往县（市、区）委直属其他党组织'
        }
        , {
            value: 457587,
            name: '转往本系统内其他党组织'
        }
        , {
            value: 6064,
            name: '转往乡镇（街道）直属其他党组织'
        }, {
            value: 2037,
            name: '转往外省（区、市）'
        }, {
            value: 26,
            name: '转往军队'
        }, {
            value: 2,
            name: '转往武警部队'
        },{
            value: 0,
            name: '转往国（境）外'

        }
    ];
    $("#f_qszc").html("转出总计:527062");
    // 全省组织关系转接转入情况
    f_Qszr= [
        {
        value:3715,
        name: '接收省内其他市'
    }, {
        value: 1801,
        name: '接收省委直属其他党组织'
    }, {
        value: 7866,
        name: '接收市内其他县（市、区）'
    }
        , {
            value: 8760,
            name: '接收市委直属其他党组织'
        }, {
            value: 35165,
            name: '接收县（市、区）内其他乡镇（街道）'
        }
        , {
            value: 4039,
            name: '接收县（市、区）委直属其他党组织'
        }

        , {
            value: 457587,
            name: '接收本系统内其他党组织'
        }
        , {
            value: 6064,
            name: '接收乡镇（街道）直属其他党组织'
        }, {
            value: 2828,
            name: '接收外省（区、市）'
        }, {
            value: 4077,
            name: '接收军队'
        }
        , {
            value: 1170,
            name: '接收武警部队'
        }, {
            value: 1,
            name: '接收国（境）外'
        }
    ];
    $("#f_qszr").html("转入总计:533082");
}
content();

//*******************中间下面的***************************
//省委直属党(工)委转出转入情况
var f_zc,f_zr;
function ContentBto(){
    //转入
    f_zr=[21310, 82713, 37341, 28386, 6633, 28746,
        57582, 29257, 43751, 18567, 7897, 3054,
        63792, 29502, 14262, 15060, 13021, 9826,
        3950, 5998, 10787, 1583, 63
    ];
    //转出
    f_zc=[20777, 82436, 37399, 28410, 6562, 28709,
        56109, 28387, 43729, 18495, 7838, 3068,
        61965, 29523, 14219, 14653, 12892, 9786,
        3959, 5677, 10827, 1583, 59
    ];
}
ContentBto();


//***************右边的*************************
//管理人员类型   管理人员注册总量   省委直属党(工)委管理人员数量分布情况(单位:人)
var f_glLx,f_an,f_sj,f_gl;
function Right(){
    // 管理人员类型
    f_glLx=[
        {value:1029, name:'安全员'},
        {value:509, name:'审计员'},
        {value:292128, name:'管理员'},
    ];
    // 管理人员注册总量
    $("#f_glzl").html("293,666");

    //省委直属党(工)委管理人员数量分布情况(单位:人)
    //安全员
    f_an=[
        58, 128, 54, 38, 23, 79, 43,
        55, 18, 33, 22, 13, 27, 17, 15,
        19, 48, 147, 23, 38, 85, 41, 5
    ];
    //审计员
    f_sj=[
        16, 41, 28, 3, 25, 67, 24,
        48, 2, 57, 17, 3, 10, 20,
        3, 3, 2, 57, 5, 6, 69, 3, 0
    ];
    //管理员
    f_gl=[
        20991, 31631, 14753, 10035, 7427, 21527,
        24285, 21297, 15980, 10885, 10048, 4719,
        21604, 14846, 15005, 13062, 12898, 8361,
        4363, 2973, 4688, 600, 150];
}
Right();