/**
 * 2018-05- 11
 * 冯晓鹏
 * 用途：手动修改数据找起来太麻烦，所以将全部数据放到一块儿便于快速修改,替换
 * **** 实时关注TOP10***没有，得在w_javascript.js里面改
 * 这里只有山东省的，没有济南市的
 */
//实时在线情况   历史在线峰值    访问分布情况
function Sszx(){
    //实时在线情况
    //总人数
    $("#f_sszx span").eq(0).html("480499人");
    //App
    $("#f_sszx span").eq(2).html("360374人");
    //WEB
    $("#f_sszx span").eq(4).html("120125人");

    //历史在线峰值
    //总人数
    $("#f_sszx span").eq(5).html("1920867人");
    //App
    $("#f_sszx span").eq(7).html("1440651人");
    //WEB
    $("#f_sszx span").eq(9).html("480216人");


    //访问分布情况
    // 党建和组织工作宣传网  基层党组织建设网
    // 党员队伍建设网  干部工作网   第一书记
    var f_fwFb=[10868327, 3672798, 2195933, 1655713, 917319];
    for (var i = 0; i < f_fwFb.length; i++) {
        $("#f_siffwfb span").eq(i).html(f_fwFb[i]);
    }
}
Sszx();


// 实时在线党员年龄/性别/学历     WEB/APP/微信访问分布饼状图
var f_sex1,f_sex2,f_sex3,f_pie;
function Left(){
// 性别
    f_sex1= [
        {value:344326, name: '男'},
        {value: 136173, name: '女'}
    ];
//年龄
    f_sex2=[
        {value:65252, name: '30岁及以下'},
        {value: 113926, name: '31-40岁'},
        {value: 143381, name: '41-50岁'},
        {value: 118443, name: '51-60岁'},
        {value: 39497, name: '61岁及以上'}
    ];
// 学历
    f_sex3=[
        {value:133723, name: '初中及以下'},
        {value: 110130, name: '高中/中专'},
        {value: 209209, name: '专科/本科'},
        {value: 27436, name: '研究生及以上'}
    ];
//   WEB/APP/微信访问分布饼状图
    f_pie=[
        {value:626071898, name:'WEB'},
        {value:832288915, name:'APP'},
        {value:20657458, name:'微信'},
    ];
    // “灯塔-党建在线”访问情况  累积访问人次
  $("#f_sifzxfw span").html("1,479,018,271");

}
Left();

//(省委直属党(工)委所属党支部开通e支部情况)
var f_ktl,f_wktl,f_ktLv;  //开通量 未开通量  开通率
function Ezhibu(){
    //开通量
     f_ktl= [18763, 29139, 13442, 9254, 6254, 20599, 24479,
         19259, 13678, 9776, 8512, 3971, 19737, 14659, 13470,
         11605, 11808, 6920, 3609, 2496, 2997, 459, 121];
     // 未开通量
    f_wktl=[1898, 1361, 334, 152, 104, 321, 659, 92, 228, 221,
        201, 67, 911, 599, 819, 133, 23, 1248, 289, 129,
        2213, 232, 12];
    // 开通率
    f_ktLv=[90.81, 95.54, 97.58, 98.38, 98.36, 98.47, 97.38, 99.52,
        98.36, 97.79, 97.69, 98.34, 95.59, 96.07, 94.27, 98.87,
        99.81, 84.72, 92.59, 95.09, 57.52, 66.43, 90.98];
    //   e支部开通总数
    $("#f_ezs").html("   265,007     \n<span style='font-size:22px;'>个</span>");
}
Ezhibu();

//省委直属党(工)委所属党员注册分布情况
var f_zcl,f_wczl,f_zcLv;  //注册量  未注测量  注册率
function dyFb(){
    //注册量
    f_zcl= [438972, 661302, 321639, 213740, 114491, 554870, 592142,
        447311, 347076, 209192, 209744, 96104, 540098, 274586,
        297427, 231877, 371174, 94791, 54913, 34890, 53589, 9835, 1223
    ];
    // 未注测量
    f_wczl=[24766 , 41346, 8190, 6779, 2270, 7158, 4082, 31756,
        29472, 11798, 10286, 1449, 33819, 17084, 14562, 3224,
        1662, 37794, 9991, 2830, 58439, 9437, 1822
    ];
     // 注册率
    f_zcLv=[94.66, 94.12, 97.52, 96.93, 98.06, 98.73, 99.32,
        93.37, 92.17, 94.66, 95.33, 98.51, 94.11, 94.14,
        95.33, 98.63, 99.55, 71.49, 84.61, 92.50,
        47.84, 51.03, 40.16
    ];
//党员注册总数
    $("#f_dyzs").html(" 6,170,986    \n<span style='font-size:22px;'>人</span>\n");
}
dyFb();

// 活跃度等基本情况(e支部活跃度) 及各个基层
var f_main,f_mains,
    //济南 青岛。。。。。。基层党支部开展活动情况
    f_main1, f_main2,f_main3,f_main4,f_main5,f_main6,
    f_main7,f_main8, f_main9,f_main10,f_main11,f_main12,
    f_main13,f_main14, f_main15,f_main16,f_main17,f_main18,
f_main19,f_main20,f_main21,f_main22,f_main23;
function Shenghyd(){
    //省 活跃数   活跃率
     f_main=[4926, 8682, 9896, 8043, 3139, 10067, 11722,
         4314, 6619, 6366, 2865, 1148, 13097, 7899,
         2221, 8569, 4307, 1029, 642, 893, 393, 25, 0
     ];
     f_mains=[23.84, 28.47, 71.84, 85.51, 49.37, 48.12, 46.63,
         22.29, 47.60, 63.68, 32.88, 28.43, 63.43, 51.77, 15.54,
         73.00, 36.40, 12.60, 16.47, 34.02, 7.54, 3.62, 0.00
     ];

     //e支部详情（xx基层党支部开展活动情况(单位:次)）组织生活数量
    //****济南*****基层党支部开展活动情况
    f_main1=[5505,	8168,	8297,	6602,	1259,	4192,	1332,	321,	15824];
   //***青岛****基层党支部开展活动情况
    f_main2=[5596,	8011,	12059,	8459,	2713,	6773,	1703,	434,	15741];
    //***淄博****基层党支部开展活动情况
    f_main3=[8891,	11656,	20769,	9930,	2710,	11930,	2862,	437,	47871];
    //***枣庄****基层党支部开展活动情况
    f_main4=[6038,	13247,	25308,	11440,	3508,	15471,	2832,	403,	49361];
    //***东营****基层党支部开展活动情况
    f_main5=[1683,	3173,	8171,	3397,	1593,	6195,	1135,	379,	16002];
    //***烟台****基层党支部开展活动情况
    f_main6=[32154,	36104,	56337,	19318,	2226,	8865,	3531,	1102,	50978];
    //***潍坊****基层党支部开展活动情况
    f_main7=[9365,	19338,	36341,	15862,	4441,	15755,	2324,	844	,26092];
    //***济宁****基层党支部开展活动情况
    f_main8=[2288,	4843,	7818,	3763,	1169,	3582,	1080,	210,	12355];
    //***泰安****基层党支部开展活动情况
    f_main9=[7436,	8691,	12083,	4870,	1758,	6159,	1584,	421,	16069];
    //***威海****基层党支部开展活动情况
    f_main10=[6986,	17507,	19116,	18400,	1128,	6269,	2253,	231,	36286];
    //***日照****基层党支部开展活动情况
    f_main11=[1498,	2068,	4510,	2258,	1017,	3581,	714,	328,	8216];
    //***莱芜****基层党支部开展活动情况
    f_main12=[1347,	2582,	2479,	1780,	552,	1016,	282,99,	2552];
    //***临沂****基层党支部开展活动情况
    f_main13=[12610,	22126,	49057,	15652,	4315,	21443,	3167,	881,	33827];
    //***德州****基层党支部开展活动情况
    f_main14=[2337,	9984,	7155,	2204,	1261,	8046,	2048,	687,	30394];
    //***聊城****基层党支部开展活动情况
    f_main15=[1471,	1591,	2975,	1642,	300,	1477,	416,	168,	3078];
    //***滨州****基层党支部开展活动情况
    f_main16=[2206,	4597,	9761,	4250,	3994,	10697,	2996,	908,	64372];
    //***菏泽****基层党支部开展活动情况
    f_main17=[5241,	5388,	6320,	2473,	820	,3483,	1367,	367,	8864];
    //***省直机关工委****基层党支部开展活动情况
    f_main18=[983,	1643,	3837,	1612,	257,	1325,	463,	148,	3613];
    //***省委教育工委****基层党支部开展活动情况
    f_main19=[103,	614,	1648,	554,	201,	838,	281,	81,	928];
    //***省国资委党委****基层党支部开展活动情况
    f_main20=[1281,	2420,	4348,	2119,	254,	1099,	405,	117,	5884];
    //***胜利油田****基层党支部开展活动情况
    f_main21=[453,	1836,	1273,	695,	120,	245,	141,	31,	539];
    //***齐鲁石化****基层党支部开展活动情况
    f_main22=[62,	51,	49,	25,	4,	6,	3,	0,	19];
    //***黄三角****基层党支部开展活动情况
    f_main23=[0,0,0,0,0,0,0,0,0];

}
Shenghyd();

//注册党员基本情况    (年龄) (性别)
var f_dyqk1,f_dyqk2,f_dyqk3;
function dyQk(){
    // (年龄)
    f_dyqk1=[
        {value: 600320, name:'30岁及以下',},
        {value:1060558, name:'31-40岁'},
        {value:1330179, name:'41-50岁'},
        {value:1264338, name:'51-60岁'},
        {value:1915591, name:'61岁及以上'},
    ];
    // (性别)
    f_dyqk2=[
        {value:4834177, name:'男'},
        {value:1336809, name:'女'}
    ];
    f_dyqk3=[
        {value:2108392, name:'初中及以下',},
        {value:1483656, name:'高中/中专'},
        {value:2348530, name:'专科/本科'},
        {value:230408, name:'研究生及以上'},
    ];
}
dyQk();